---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FbxLightInitialIntensityInputMethod
source: html/3513eae4-27ae-8827-c8e7-07bc0751aceb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FbxLightInitialIntensityInputMethod Property

"Initial Light Intensity Input Method"

## Syntax (C#)
```csharp
public static ForgeTypeId FbxLightInitialIntensityInputMethod { get; }
```